app/views/disciplines/_form.html.erb

    <div class="col-lg-10">
      <%= f.collection_select :teacher_id, Teacher.all, :id, :name, {include_blank: true}, {class: 'form-control'} %>
---
SELECT "teachers".* FROM "teachers"