app/views/mentions/_form.html.erb

    <select name="post[discipline]" class="form-group control-label col-lg-3">
      <% Discipline.all.each do |discipline| %>
---
SELECT "disciplines".* FROM "disciplines"

    <div class="col-lg-10">
      <%= f.collection_select :teacher_id, Teacher.all, :id, :name, {include_blank: true}, {class: 'form-control'} %>
---
SELECT "teachers".* FROM "teachers"

    <div class="col-lg-10">
      <%= f.collection_select :period_id, Period.all, :id, :name, {include_blank: true}, {:class => 'form-control'} %>
---
SELECT "periods".* FROM "periods"