app/controllers/disciplines_controller.rb

  def index
    @disciplines = Discipline.all
---
SELECT "disciplines".* FROM "disciplines"

  def create
    @discipline = Discipline.new(discipline_params)

    respond_to do |format|
      if @discipline.save
---
INSERT INTO "disciplines" ("name", "amount_credits", "teacher_id", "period_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "c1"], ["amount_credits", 6], ["teacher_id", 1], ["period_id", 1], ["created_at", "2016-10-01 14:35:10.242341"], ["updated_at", "2016-10-01 14:35:10.242341"]]

  def destroy
    @discipline.destroy
---
DELETE FROM "disciplines" WHERE "disciplines"."id" = ?  [["id", 1]]

    def set_discipline
      @discipline = Discipline.find(params[:id])
---
SELECT  "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = ? LIMIT 1  [["id", 1]]