app/controllers/mentions_controller.rb

SELECT "mentions".* FROM "mentions"
---
  def index
    @mentions = Mention.all

INSERT INTO "mentions" ("value", "discipline_id", "period_id", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["value", "II"], ["discipline_id", 1], ["period_id", 1], ["teacher_id", 1], ["created_at", "2016-10-01 14:35:26.826918"], ["updated_at", "2016-10-01 14:35:26.826918"]]
---
  def create
    @mention = Mention.new(mention_params)

    respond_to do |format|
      if @mention.save

SELECT  "mentions".* FROM "mentions" WHERE "mentions"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_mention
      @mention = Mention.find(params[:id])