app/controllers/periods_controller.rb

  def index
    @periods = Period.all
---
SELECT "periods".* FROM "periods"

  def create
    @period = Period.new(period_params)

    respond_to do |format|
      if @period.save
---
INSERT INTO "periods" ("name", "start", "finish", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1 Semestre"], ["start", "2016-09-30"], ["finish", "2016-09-30"], ["created_at", "2016-09-30 14:42:04.136135"], ["updated_at", "2016-09-30 14:42:04.136135"]]

  def destroy
    @period.destroy
---
DELETE FROM "periods" WHERE "periods"."id" = ?  [["id", 1]]

    def set_period
      @period = Period.find(params[:id])
---
SELECT  "periods".* FROM "periods" WHERE "periods"."id" = ? LIMIT 1  [["id", 1]]