app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Professor Teste"], ["created_at", "2016-09-30 14:39:18.652640"], ["updated_at", "2016-09-30 14:39:18.652640"]]